Интеграция_со_СДЕК/src/Catalogs/зс_сдэк_ПунктыВыдачиЗаказов/зс_сдэк_ПунктыВыдачиЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зс_сдэк_ПунктыВыдачиЗаказов</name>
  <attributes>
    <name>CityCode</name>
    <comment>Код города по базе СДЭК (см. файл «City_XXX_YYYYMMDD.xls»)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WorkTime</name>
    <comment>Режим работы, строка вида «пн-пт 9-18, сб 9-16»</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address</name>
    <comment>Адрес (улица, дом, офис) в указанном городе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Note</name>
    <comment>Примечание. Описание местоположения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoordX</name>
    <comment>Координаты местоположения (долгота) в градусах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoordY</name>
    <comment>Координаты местоположения (широта) в градусах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightMin</name>
    <comment>Минимальный вес (в кг.), принимаемый в ПВЗ (> WeightMin)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightMax</name>
    <comment>Максимальный вес (в кг.), принимаемый в ПВЗ (&lt;=WeightMax)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <comment>Тип ПВЗ: Склад СДЭК или Почтомат партнера, PVZ —  склад СДЭК, POSTOMAT — почтомат партнера СДЭК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OwnerCode</name>
    <comment>Принадлежность ПВЗ компании: CDEK — ПВЗ принадлежит компании СДЭК, InPost — ПВЗ принадлежит компании InPost.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegionCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegionName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullAddress</name>
    <comment>Полный адрес с указанием страны, региона, города, и т.д.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsDressingRoom</name>
    <comment>Есть ли примерочная</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HaveCashless</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NearestStation</name>
    <comment>Ближайшая станция/остановка транспорта </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Site</name>
    <comment>Сайт пвз на странице СДЭК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MetroStation</name>
    <comment>Ближайшая станция метро</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешОписанияПоставщика</name>
    <comment>Хеш строки описания пункта выдачи, который получен от поставщика, нужен для поиска изменившихся пунктов выдачи</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>47</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>WorkTimeY</name>
    <comment>график работы на неделю. Вложенный тег с атрибутами day и period.</comment>
    <attributes>
      <name>day</name>
      <comment>Порядковый номер дня начиная с единицы. Понедельник = 1, воскресенье = 7.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>period</name>
      <comment>Ориг. название periods - зарезервированное слово. Период работы в эти дни. ¶Если в этот день не работают, то не отображать. ¶&lt;WorkTimeY day=&quot;1&quot; periods=&quot;10:00/20:00&quot;/>¶&lt;WorkTimeY day=&quot;2&quot; periods=&quot;10:00/20:00&quot;/>¶</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OfficeImage</name>
    <comment>Все фото офиса (кроме фото как доехать).</comment>
    <attributes>
      <name>url</name>
      <comment>Все фотографии отдельным тегом с атрибутом url. Отображается ссылка на картинку.¶&lt;OfficeImage url=&quot;http://dfdfdf/images/22/47_1_SUR2&quot;/>¶</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OfficeHowGo</name>
    <comment>Картинка с указанием как доехать</comment>
    <attributes>
      <name>url</name>
      <comment>Картинка с изображением схемы проезда. Отображается ссылка на картинку.¶&lt;OfficeHowGo url=&quot;http://dfdfdf/images/7/42_1_NSK1&quot;/>¶</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Интеграция_со_СДЕК/src/CommonModules/зс_сдэк_БизнесЛогикаСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// зс_сдэк_БизнесЛогикаСервер: процедуры и функции реализации бизнес-логики интеграции со СДЭК
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ОбновитьПунктыВыдачиЗаказов() Экспорт
	
	// получить все пункты выдачи
	
	СтруктураВозврата = зс_сдэк_ИнтеграцияСервер.ПолучитьСписокПунктовВыдачиЗаказов(Неопределено, Неопределено);
	
	Если НЕ СтруктураВозврата.ДанныеПолучены Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	МассивКодовПунктовВыдачи = Новый Массив;
	
	Для каждого ОписаниеПунктаВыдачи Из СтруктураВозврата.Данные Цикл
	
		ТекущийПунктВыдачи = Справочники.зс_сдэк_ПунктыВыдачиЗаказов.НайтиПоКоду(ОписаниеПунктаВыдачи["Code"]);
		
		Если ТекущийПунктВыдачи = Справочники.зс_сдэк_ПунктыВыдачиЗаказов.ПустаяСсылка() Тогда // новый пункт выдачи
			
			ИзменитьПунктВыдачи(ОписаниеПунктаВыдачи);
			
		Иначе
			
			Если ТекущийПунктВыдачи.ХешОписанияПоставщика <> ОписаниеПунктаВыдачи["ХешОписанияПоставщика"] Тогда // измененный пункт выдачи
				
				ИзменитьПунктВыдачи(ОписаниеПунктаВыдачи, ТекущийПунктВыдачи);
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивКодовПунктовВыдачи.Добавить(ОписаниеПунктаВыдачи["Code"]);
		
	КонецЦикла;
	
	Выборка = Справочники.зс_сдэк_ПунктыВыдачиЗаказов.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если МассивКодовПунктовВыдачи.Найти(Выборка.Код) = Неопределено Тогда // удаленный пункт выдачи
			
			УдалитьПунктВыдачи(Выборка.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСрокИСтоимостьДоставки(ДатаОтправления, 
										КодГородаОтправления, 
										КодГородаПолучения, 
										ИдентификаторТарифа, 
										МассивОписанийТоваров, 
										Логин = Неопределено, 
										Пароль = Неопределено) Экспорт
										
	СтруктураПараметровЗапроса = Новый Структура;
	СтруктураПараметровЗапроса.Вставить("version", "1.0");
	СтруктураПараметровЗапроса.Вставить("dateExecute", ДатаОтправления);
	СтруктураПараметровЗапроса.Вставить("senderCityId", КодГородаОтправления);
	СтруктураПараметровЗапроса.Вставить("receiverCityId", КодГородаПолучения);
	СтруктураПараметровЗапроса.Вставить("tariffId", ИдентификаторТарифа);
	
	Если Логин <> Неопределено Тогда
	
		СтруктураПараметровЗапроса.Вставить("authLogin", Логин);
		
	КонецЕсли;
	
	Если Пароль = Неопределено Тогда
		
		СтруктураПараметровЗапроса.Вставить("secure", Пароль);
		
	КонецЕсли;
			
	СтруктураПараметровЗапроса.Вставить("goods", МассивОписанийТоваров);
										
	СтруктураВозврата = зс_сдэк_ИнтеграцияСервер.ПолучитьСтоимостьИСрокДоставки(СтруктураПараметровЗапроса);
	
	Если СтруктураВозврата.ДанныеПолучены Тогда
	
		СтруктураСроковИСтоимости = Новый Структура;
		СтруктураСроковИСтоимости.Вставить("Цена", СтруктураВозврата.Данные["price"]);
		СтруктураСроковИСтоимости.Вставить("МинимальныйСрокДоставки", СтруктураВозврата.Данные["deliveryPeriodMin"]);
		СтруктураСроковИСтоимости.Вставить("МаксимальныйСрокДоставки", СтруктураВозврата.Данные["deliveryPeriodMax"]);
		
		СтруктураВозврата.Данные = СтруктураСроковИСтоимости;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИзменитьПунктВыдачи(ОписаниеПунктаВыдачи, ТекущийПунктВыдачи = Неопределено) Экспорт
	
	ЭтоНовыйПунктВыдачи = Ложь;
	
	Если ЗначениеЗаполнено(ТекущийПунктВыдачи) Тогда
		
		ИзмененныйПунктВыдачи = ТекущийПунктВыдачи.ПолучитьОбъект();
		
	Иначе
		
		ЭтоНовыйПунктВыдачи = Истина;
		
		ИзмененныйПунктВыдачи = Справочники.зс_сдэк_ПунктыВыдачиЗаказов.СоздатьЭлемент();
		
	КонецЕсли;
		
	Для каждого Поле Из ОписаниеПунктаВыдачи Цикл
	
		Если Поле.Ключ = "Code" Тогда
			
			ИзмененныйПунктВыдачи.Код = Поле.Значение;
			
		ИначеЕсли Поле.Ключ = "Name" Тогда
			
			ИзмененныйПунктВыдачи.Наименование = Поле.Значение;
			
		ИначеЕсли Поле.Ключ = "WorkTimeY" Тогда
			
		ИначеЕсли Поле.Ключ = "OfficeImage" Тогда
			
		ИначеЕсли Поле.Ключ = "OfficeHowGo" Тогда
			
		Иначе
			
			ИзмененныйПунктВыдачи[Поле.Ключ] = Поле.Значение;
			
		КонецЕсли;
	
	КонецЦикла;
		
	ИзмененныйПунктВыдачи.Записать();
	
	Если ЭтоНовыйПунктВыдачи Тогда
		
		зс_сдэк_ПереопределяемыйСервер.ПриДобавленииПунктаВыдачиПереопределяемая("СДЭК", ИзмененныйПунктВыдачи.Ссылка);
		
	Иначе
		
		зс_сдэк_ПереопределяемыйСервер.ПриИзмененииПунктаВыдачиПереопределяемая("СДЭК", ИзмененныйПунктВыдачи.Ссылка);
		
	КонецЕсли;
	
	Возврат ИзмененныйПунктВыдачи.Ссылка;
	
КонецФункции

Процедура УдалитьПунктВыдачи(ТекущийПунктВыдачи) Экспорт
	
	ИзмененныйПунктВыдачи = ТекущийПунктВыдачи.ПолучитьОбъект();
	ИзмененныйПунктВыдачи.УстановитьПометкуУдаления(Истина);
	
	зс_сдэк_ПереопределяемыйСервер.ПриПометкеНаУдалениеПунктаВыдачиПереопределяемая("СДЭК", ИзмененныйПунктВыдачи.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
